src/test/resources/nl/ordina/digikoppeling/ebf/ubl/UBL-Invoice-1.7c-Example07.xml

<?xml version="1.0" encoding="UTF-8"?>
<doc:Invoice 
	xsi:schemaLocation="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2 ../xsdrt/maindoc/Invoice.xsd urn:digi-inkoop:ubl:2.0:NL:1.7:UBL-NL-CommonBasicComponents-2 ../xsdrt/common/UBL-CommonBasicComponents-2.0-NL-1.7.xsd" 
 xmlns:doc="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2" 
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
 xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" 
 xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2"
 xmlns:ext="urn:oasis:names:specification:ubl:schema:xsd:CommonExtensionComponents-2"
 xmlns:nl-cbc="urn:digi-inkoop:ubl:2.0:NL:1.7:UBL-NL-CommonBasicComponents-2">
	<ext:UBLExtensions>
		<ext:UBLExtension>
			<ext:ExtensionContent>
				<nl-cbc:LastInvoiceOnOrderIndicator>false</nl-cbc:LastInvoiceOnOrderIndicator>
			</ext:ExtensionContent>
		</ext:UBLExtension>
	</ext:UBLExtensions>
	<cbc:UBLVersionID>2.0</cbc:UBLVersionID>
	<cbc:CustomizationID>1.7</cbc:CustomizationID>
	<cbc:ProfileID>NL</cbc:ProfileID>
	<cbc:ID>INV12345</cbc:ID>
	<cbc:IssueDate>2011-01-01</cbc:IssueDate>
	<cbc:InvoiceTypeCode listAgencyID="88" listAgencyName="Logius Gegevensbeheer NL-Overheid" listID="NL-1001" listName="FactuurSoort" listSchemeURI="urn:digi-inkoop:ubl:2.0:NL:1.7:gc:InvoiceTypeCode" listURI="http://www.nltaxonomie.nl/ubl/2.0/NL/1.7/cl/gc/InvoiceTypeCode.gc" listVersionID="1.7">D</cbc:InvoiceTypeCode>
	<cbc:Note>please state your customernr, invoicenummer, shoesize and nickname for remittance.</cbc:Note>
	<cac:OrderReference>
		<cbc:ID>telephonecall D. Blo</cbc:ID>
	</cac:OrderReference>
	<cac:AccountingSupplierParty>
		<cac:Party>
			<cac:PartyIdentification>
				<cbc:ID schemeAgencyID="SE" schemeAgencyName="XXX">XYZ123456</cbc:ID>
			</cac:PartyIdentification>
			<cac:PartyIdentification>
				<cbc:ID schemeAgencyID="SE" schemeAgencyName="Fi">SE12345678C01</cbc:ID>
			</cac:PartyIdentification>
			<cac:PartyName>
				<cbc:Name>Lev Erancier Inc</cbc:Name>
			</cac:PartyName>
			<cac:PostalAddress>
				<cbc:StreetName>MainSt</cbc:StreetName>
				<cbc:CityName>St. Jean</cbc:CityName>
				<cbc:PostalZone>31400</cbc:PostalZone>
				<cac:Country>
					<cbc:IdentificationCode listAgencyName="United Nations Economic Commission for Europe" listAgencyID="6" listName="Country" listID="ISO3166-1" listSchemeURI="urn:oasis:names:specification:ubl:codelist:gc:CountryIdentificationCode" listURI="http://docs.oasis-open.org/ubl/os-UBL-2.0-update/cl/gc/default/CountryIdentificationCode-2.0.gc" listVersionID="0.3">SE</cbc:IdentificationCode>
				</cac:Country>
			</cac:PostalAddress>
			<cac:Contact>
				<cbc:Name>List</cbc:Name>
				<cbc:Telephone>00451234567893</cbc:Telephone>
				<cbc:ElectronicMail>list@bedrog.se</cbc:ElectronicMail>
			</cac:Contact>
		</cac:Party>
	</cac:AccountingSupplierParty>
	<cac:AccountingCustomerParty>
		<cac:Party>
			<cac:PartyIdentification>
				<cbc:ID schemeAgencyID="NL" schemeAgencyName="XXX">08115596</cbc:ID>
			</cac:PartyIdentification>
			<cac:PartyIdentification>
				<cbc:ID schemeAgencyID="NL" schemeAgencyName="BTW">NL12345678B01</cbc:ID>
			</cac:PartyIdentification>
			<cac:PartyName>
				<cbc:Name>Cust Omer BV</cbc:Name>
			</cac:PartyName>
			<cac:PostalAddress>
				<cbc:StreetName>Postbusstraat</cbc:StreetName>
				<cbc:BuildingNumber>1</cbc:BuildingNumber>
				<cbc:CityName>plaatsstad</cbc:CityName>
				<cbc:PostalZone>1234AB</cbc:PostalZone>
				<cac:Country>
					<cbc:IdentificationCode listAgencyName="United Nations Economic Commission for Europe" listAgencyID="6" listName="Country" listID="ISO3166-1" listSchemeURI="urn:oasis:names:specification:ubl:codelist:gc:CountryIdentificationCode" listURI="http://docs.oasis-open.org/ubl/os-UBL-2.0-update/cl/gc/default/CountryIdentificationCode-2.0.gc" listVersionID="0.3">SE</cbc:IdentificationCode>
				</cac:Country>
			</cac:PostalAddress>
			<cac:Contact>
				<cbc:Name>Cust Omerself</cbc:Name>
				<cbc:Telephone>0031881234</cbc:Telephone>
				<cbc:ElectronicMail>omerself@omer.com</cbc:ElectronicMail>
			</cac:Contact>
		</cac:Party>
	</cac:AccountingCustomerParty>
	<cac:Delivery>
		<cbc:ActualDeliveryDate>2000-01-01</cbc:ActualDeliveryDate>
		<cac:DeliveryAddress>
			<cbc:Floor>2</cbc:Floor>
			<cbc:Room>46</cbc:Room>
			<cbc:StreetName>afleverstraat</cbc:StreetName>
			<cbc:BuildingNumber>100</cbc:BuildingNumber>
			<cbc:PlotIdentification>industrieterrein 'het afleverwerk'</cbc:PlotIdentification>
			<cbc:CityName>stadplaatslevering</cbc:CityName>
			<cbc:PostalZone>1000XX</cbc:PostalZone>
			<cac:Country>
				<cbc:IdentificationCode listAgencyName="United Nations Economic Commission for Europe" listAgencyID="6" listName="Country" listID="ISO3166-1" listSchemeURI="urn:oasis:names:specification:ubl:codelist:gc:CountryIdentificationCode" listURI="http://docs.oasis-open.org/ubl/os-UBL-2.0-update/cl/gc/default/CountryIdentificationCode-2.0.gc" listVersionID="0.3">NL</cbc:IdentificationCode>
			</cac:Country>
		</cac:DeliveryAddress>
	</cac:Delivery>
	<cac:DeliveryTerms>
		<cbc:ID schemeID="NL-1002" schemeName="DeliveryTermsCode" schemeURI="http://www.nltaxonomie.nl/ubl/2.0/NL/1.7/cl/gc/DeliveryTermsCode.gc" schemeDataURI="urn:digi-inkoop:ubl:2.0:NL:1.7:gc:DeliveryTermsCode" schemeAgencyID="88" schemeAgencyName="Logius Gegevensbeheer NL-Overheid" schemeVersionID="1.7">FOB</cbc:ID>
		<cbc:SpecialTerms>DDP Nederlend</cbc:SpecialTerms>
	</cac:DeliveryTerms>
	<cac:PaymentMeans>
		<cbc:PaymentMeansCode>42</cbc:PaymentMeansCode>
		<cac:PayeeFinancialAccount>
			<cbc:ID>888999</cbc:ID>
			<cac:FinancialInstitutionBranch>
				<cac:FinancialInstitution>
					<cbc:ID>SEBJ1234</cbc:ID>
					<cbc:Name>swedenbanken St Jean</cbc:Name>
				</cac:FinancialInstitution>
			</cac:FinancialInstitutionBranch>
		</cac:PayeeFinancialAccount>
	</cac:PaymentMeans>
	<cac:PaymentTerms>
		<cbc:SettlementDiscountPercent>2.00</cbc:SettlementDiscountPercent>
		<cac:SettlementPeriod>
			<cbc:DurationMeasure unitCode="DAY">10</cbc:DurationMeasure>
		</cac:SettlementPeriod>
	</cac:PaymentTerms>
	<cac:PaymentTerms>
		<cbc:SettlementDiscountPercent>1.00</cbc:SettlementDiscountPercent>
		<cac:SettlementPeriod>
			<cbc:DurationMeasure unitCode="DAY">30</cbc:DurationMeasure>
		</cac:SettlementPeriod>
	</cac:PaymentTerms>
	<cac:PaymentTerms>
		<cbc:Note>60 days nett</cbc:Note>
	</cac:PaymentTerms>
	<cac:AllowanceCharge>
		<cbc:ChargeIndicator>false</cbc:ChargeIndicator>
		<cbc:AllowanceChargeReason>order discount</cbc:AllowanceChargeReason>
		<cbc:Amount currencyID="SEK">200</cbc:Amount>
	</cac:AllowanceCharge>
	<cac:AllowanceCharge>
		<cbc:ChargeIndicator>true</cbc:ChargeIndicator>
		<cbc:AllowanceChargeReason>packaging</cbc:AllowanceChargeReason>
		<cbc:Amount currencyID="SEK">800</cbc:Amount>
	</cac:AllowanceCharge>
	<cac:AllowanceCharge>
		<cbc:ChargeIndicator>true</cbc:ChargeIndicator>
		<cbc:AllowanceChargeReason>additional unspecified charges</cbc:AllowanceChargeReason>
		<cbc:Amount currencyID="SEK">1799</cbc:Amount>
	</cac:AllowanceCharge>
	<cac:AllowanceCharge>
		<cbc:ChargeIndicator>true</cbc:ChargeIndicator>
		<cbc:AllowanceChargeReason>credit restrictions</cbc:AllowanceChargeReason>
		<cbc:Amount currencyID="EUR">14.06</cbc:Amount>
	</cac:AllowanceCharge>
	<cac:TaxTotal>
		<cbc:TaxAmount currencyID="EUR">183.83</cbc:TaxAmount>
		<cac:TaxSubtotal>
			<cbc:TaxableAmount currencyID="SEK">600</cbc:TaxableAmount>
			<cbc:TaxAmount currencyID="SEK">102</cbc:TaxAmount>
			<cac:TaxCategory>
				<cbc:Percent>20.00</cbc:Percent>
				<cac:TaxScheme>
					<cbc:Name>BTW</cbc:Name>
				</cac:TaxScheme>
			</cac:TaxCategory>
		</cac:TaxSubtotal>
		<cac:TaxSubtotal>
			<cbc:TaxableAmount currencyID="USD">50</cbc:TaxableAmount>
			<cbc:TaxAmount currencyID="USD">18.75</cbc:TaxAmount>
			<cac:TaxCategory>
				<cbc:Percent>20.00</cbc:Percent>
				<cac:TaxScheme>
					<cbc:Name>BTW</cbc:Name>
				</cac:TaxScheme>
			</cac:TaxCategory>
		</cac:TaxSubtotal>
		<cac:TaxSubtotal>
			<cbc:TaxableAmount currencyID="SEK">510</cbc:TaxableAmount>
			<cbc:TaxAmount currencyID="SEK">51</cbc:TaxAmount>
			<cac:TaxCategory>
				<cbc:Percent>10.00</cbc:Percent>
				<cac:TaxScheme>
					<cbc:Name>Overige</cbc:Name>
				</cac:TaxScheme>
			</cac:TaxCategory>
		</cac:TaxSubtotal>
		<cac:TaxSubtotal>
			<cbc:TaxableAmount currencyID="USD">75</cbc:TaxableAmount>
			<cbc:TaxAmount currencyID="USD">37.50</cbc:TaxAmount>
			<cac:TaxCategory>
				<cbc:Percent>50.00</cbc:Percent>
				<cac:TaxScheme>
					<cbc:Name>Overige</cbc:Name>
				</cac:TaxScheme>
			</cac:TaxCategory>
		</cac:TaxSubtotal>
	</cac:TaxTotal>
	<cac:LegalMonetaryTotal>
		<cbc:LineExtensionAmount currencyID="EUR">702.83</cbc:LineExtensionAmount>
		<cbc:TaxExclusiveAmount currencyID="EUR">533.06</cbc:TaxExclusiveAmount>
		<cbc:TaxInclusiveAmount currencyID="EUR">0.00</cbc:TaxInclusiveAmount>
		<cbc:PayableAmount currencyID="EUR">716.88</cbc:PayableAmount>
	</cac:LegalMonetaryTotal>
	<cac:InvoiceLine>
		<cbc:ID>001</cbc:ID>
		<cbc:InvoicedQuantity unitCode="DZN">10</cbc:InvoicedQuantity>
		<cbc:LineExtensionAmount currencyID="SEK">663</cbc:LineExtensionAmount>
		<cbc:FreeOfChargeIndicator>false</cbc:FreeOfChargeIndicator>
		<cac:OrderLineReference>
			<cbc:LineID>1</cbc:LineID>
			<cac:OrderReference>
				<cbc:ID>45.001.524.010</cbc:ID>
			</cac:OrderReference>
		</cac:OrderLineReference>
		<cac:AllowanceCharge>
			<cbc:ChargeIndicator>false</cbc:ChargeIndicator>
			<cbc:MultiplierFactorNumeric>15.00</cbc:MultiplierFactorNumeric>
			<cbc:Amount currencyID="SEK">90</cbc:Amount>
			<cbc:BaseAmount currencyID="SEK">600</cbc:BaseAmount>
		</cac:AllowanceCharge>
		<cac:TaxTotal>
			<cbc:TaxAmount currencyID="SEK">153</cbc:TaxAmount>
			<cac:TaxSubtotal>
				<cbc:TaxableAmount currencyID="SEK">600</cbc:TaxableAmount>
				<cbc:TaxAmount currencyID="SEK">102</cbc:TaxAmount>
				<cac:TaxCategory>
					<cbc:Percent>20.00</cbc:Percent>
					<cac:TaxScheme>
						<cbc:Name>BTW</cbc:Name>
					</cac:TaxScheme>
				</cac:TaxCategory>
			</cac:TaxSubtotal>
			<cac:TaxSubtotal>
				<cbc:TaxableAmount currencyID="SEK">510</cbc:TaxableAmount>
				<cbc:TaxAmount currencyID="SEK">51</cbc:TaxAmount>
				<cac:TaxCategory>
					<cbc:Percent>10.00</cbc:Percent>
					<cac:TaxScheme>
						<cbc:Name>Overige</cbc:Name>
					</cac:TaxScheme>
				</cac:TaxCategory>
			</cac:TaxSubtotal>
		</cac:TaxTotal>
		<cac:Item>
			<cbc:CatalogueIndicator>false</cbc:CatalogueIndicator>
			<cbc:Name>myart1</cbc:Name>
			<cac:BuyersItemIdentification>
				<cbc:ID>youart1</cbc:ID>
			</cac:BuyersItemIdentification>
			<cac:SellersItemIdentification>
				<cbc:ID>art123</cbc:ID>
			</cac:SellersItemIdentification>
		</cac:Item>
		<cac:Price>
			<cbc:PriceAmount currencyID="SEK">5</cbc:PriceAmount>
			<cbc:BaseQuantity unitCode="NAR">12</cbc:BaseQuantity>
		</cac:Price>
	</cac:InvoiceLine>
	<cac:InvoiceLine>
		<cbc:ID>002</cbc:ID>
		<cbc:InvoicedQuantity unitCode="NAR">15</cbc:InvoicedQuantity>
		<cbc:LineExtensionAmount currencyID="USD">116.25</cbc:LineExtensionAmount>
		<cbc:FreeOfChargeIndicator>false</cbc:FreeOfChargeIndicator>
		<cac:OrderLineReference>
			<cbc:LineID>2</cbc:LineID>
			<cac:OrderReference>
				<cbc:ID>45.001.524.012</cbc:ID>
			</cac:OrderReference>
		</cac:OrderLineReference>
		<cac:TaxTotal>
			<cbc:TaxAmount currencyID="USD">41.25</cbc:TaxAmount>
			<cac:TaxSubtotal>
				<cbc:TaxableAmount currencyID="USD">75</cbc:TaxableAmount>
				<cbc:TaxAmount currencyID="SEK">3.75</cbc:TaxAmount>
				<cac:TaxCategory>
					<cbc:Percent>5.00</cbc:Percent>
					<cac:TaxScheme>
						<cbc:Name>BTW</cbc:Name>
					</cac:TaxScheme>
				</cac:TaxCategory>
			</cac:TaxSubtotal>
			<cac:TaxSubtotal>
				<cbc:TaxableAmount currencyID="USD">75</cbc:TaxableAmount>
				<cbc:TaxAmount currencyID="USD">37.50</cbc:TaxAmount>
				<cac:TaxCategory>
					<cbc:Percent>50.00</cbc:Percent>
					<cac:TaxScheme>
						<cbc:Name>Overige</cbc:Name>
					</cac:TaxScheme>
				</cac:TaxCategory>
			</cac:TaxSubtotal>
		</cac:TaxTotal>
		<cac:Item>
			<cbc:CatalogueIndicator>false</cbc:CatalogueIndicator>
			<cbc:Name>myart2</cbc:Name>
			<cac:BuyersItemIdentification>
				<cbc:ID>youart2</cbc:ID>
			</cac:BuyersItemIdentification>
			<cac:SellersItemIdentification>
				<cbc:ID>art124</cbc:ID>
			</cac:SellersItemIdentification>
		</cac:Item>
		<cac:Price>
			<cbc:PriceAmount currencyID="USD">5</cbc:PriceAmount>
			<cbc:BaseQuantity unitCode="NAR">2</cbc:BaseQuantity>
		</cac:Price>
	</cac:InvoiceLine>
	<cac:InvoiceLine>
		<cbc:ID>003</cbc:ID>
		<cbc:InvoicedQuantity unitCode="NPR">20</cbc:InvoicedQuantity>
		<cbc:LineExtensionAmount currencyID="USD">65</cbc:LineExtensionAmount>
		<cbc:FreeOfChargeIndicator>false</cbc:FreeOfChargeIndicator>
		<cac:OrderLineReference>
			<cbc:LineID>3</cbc:LineID>
			<cac:OrderReference>
				<cbc:ID>45.001.524.014</cbc:ID>
			</cac:OrderReference>
		</cac:OrderLineReference>
		<cac:AllowanceCharge>
			<cbc:ChargeIndicator>false</cbc:ChargeIndicator>
			<cbc:MultiplierFactorNumeric>50.00</cbc:MultiplierFactorNumeric>
			<cbc:Amount currencyID="USD">50</cbc:Amount>
			<cbc:BaseAmount currencyID="USD">100</cbc:BaseAmount>
		</cac:AllowanceCharge>
		<cac:TaxTotal>
			<cbc:TaxAmount currencyID="USD">15</cbc:TaxAmount>
			<cac:TaxSubtotal>
				<cbc:TaxableAmount currencyID="USD">50</cbc:TaxableAmount>
				<cbc:TaxAmount currencyID="USD">15</cbc:TaxAmount>
				<cac:TaxCategory>
					<cbc:Percent>20.00</cbc:Percent>
					<cac:TaxScheme>
						<cbc:Name>BTW</cbc:Name>
					</cac:TaxScheme>
				</cac:TaxCategory>
			</cac:TaxSubtotal>
		</cac:TaxTotal>
		<cac:Item>
			<cbc:CatalogueIndicator>false</cbc:CatalogueIndicator>
			<cbc:Name>myart3</cbc:Name>
			<cac:BuyersItemIdentification>
				<cbc:ID>youart3</cbc:ID>
			</cac:BuyersItemIdentification>
			<cac:SellersItemIdentification>
				<cbc:ID>art125</cbc:ID>
			</cac:SellersItemIdentification>
		</cac:Item>
		<cac:Price>
			<cbc:PriceAmount currencyID="USD">5</cbc:PriceAmount>
			<cbc:BaseQuantity unitCode="NAR">2</cbc:BaseQuantity>
		</cac:Price>
	</cac:InvoiceLine>
</doc:Invoice>
